## Plan Result (sbox_landing)




<pre><code>Plan: 0 to add, 3 to change, 0 to destroy.</code></pre>

* Update
  * module.data_landing_zone[&#34;00&#34;].module.logging_vault.azurerm_monitor_diagnostic_setting.kv-ds
  * module.data_landing_zone[&#34;00&#34;].module.metadata_vault[&#34;meta001&#34;].azurerm_monitor_diagnostic_setting.kv-ds
  * module.data_landing_zone[&#34;00&#34;].module.metadata_vault[&#34;meta002&#34;].azurerm_monitor_diagnostic_setting.kv-ds




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.data_landing_zone["00"].module.logging_vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-logging-sbox/providers/Microsoft.KeyVault/vaults/ingest00-logging-sbox|ingest00-logging-sbox"
        name                           = "ingest00-logging-sbox"
        # (3 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.metadata_vault["meta001"].azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-metadata-sbox/providers/Microsoft.KeyVault/vaults/ingest00-meta001-sbox|ingest00-meta001-sbox"
        name                           = "ingest00-meta001-sbox"
        # (3 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.metadata_vault["meta002"].azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-metadata-sbox/providers/Microsoft.KeyVault/vaults/ingest00-meta002-sbox|ingest00-meta002-sbox"
        name                           = "ingest00-meta002-sbox"
        # (3 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.shir001.module.shir_vmss.data.azurerm_subscription.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "current" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

Plan: 0 to add, 3 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":17,"Program":"tfcmt","SHA1":"","Target":"sbox_landing","Vars":{}} -->